deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	char* message[] = { "Dry values:", stringPool20b1, stringPool20b2, stringPool20b3 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawWetValuesScreen(Adafruit_SSD1306* display) {
	sprintf(stringPool20b1, "Near: %d", state.s[MS_SENSOR_NEAR].wet);
	sprintf(stringPool20b2, "Mid: %d", state.s[MS_SENSOR_MID].wet);
	sprintf(stringPool20b3, "Far: %d", state.s[MS_SENSOR_FAR].wet);

	char* message[] = { "Wet values:", stringPool20b1, stringPool20b2, stringPool20b3 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawStartingValuesScreen(Adafruit_SSD1306* display) {
	drawDryValuesScreen(display);
	delay(5000);
	drawWetValuesScreen(display);
	delay(5000);
	(*display).clearDisplay();
}

void showTextCaptionScreen(Adafruit_SSD1306* display, const char* caption) {
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedText(&canvas, caption, MS_FONT_TEXT_SIZE_LARGE, MS_V_CENTER | MS_H_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void showActionPromptScreen(Adafruit_SSD1306* display, char* btn, char* action) {
	sprintf(stringPool20b1, "Press %s", btn);
	char* message[] = { stringPool20b1, action };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 2, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawSplashScreen(Adafruit_SSD1306* display) {
	sprintf(stringPool10b1, "Version: %s", MS_SYSTEM_VERSION);
	char* texts[] = { "Irrigation", "System", stringPool10b1 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	canvas.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT, 10, SSD1306_WHITE);
	printAlignedTextStack(&canvas, texts, 3, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

// end of Display


void extractMedianPinValueForProperty(int delayInterval, int* target, int sensorPin) {
	int value = 0;
	int iterations = 10;

	for (int i = 0; i < iterations; i++) {
		value += fixedAnalogRead(sensorPin);
		if (delayInterval > 0) {
			delay(delayInterval);
		}
	}

	(*target) = (int)(value / iterations);
}

// End of Helpers

// Actions

// Outlets

// Far

void startFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, LOW);
	state.vf = true;
}

void tickFarOutlet(Action* a) {
}

void stopFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, HIGH);
	state.vf = false;
}

// end of Far

// Mid

void startMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, LOW);
	state.vm = true;
}

void tickMidOutlet(Action* a) {
}

void stopMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, HIGH);
	state.vm = false;
}

// end of Mid

// Near

void startNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, LOW);
	state.vn = true;
}

void tickNearOutlet(Action* a) {
}

void stopNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, HIGH);
	state.vn = false;
}

// end of Near
//

// wifi
WebServer server(80);

char* _resolveWiFIStatusString(char* target, int status) {
	char* message;
	switch (wifi.state) {
	case MS_WIFI_CONNECTED:
		message = "connected";
		break;
	case MS_WIFI_DISCONNECTED:
		message = "disconnected";
		break;
	case MS_WIFI_FAILED:
		message = "failed";
		break;
	case MS_WIFI_LOST:
		message = "lost";
		break;
	case MS_WIFI_IDLE:
		message = "idle";
		break;
	case MS_WIFI_NO_SSID:
		message = "no ssid";
		break;
	case MS_WIFI_SCAN_COMPL:
		message = "scan compl";
		break;
	case MS_WIFI_NO_SHIELD:
		message = "no shield";
		break;
	default:
		message = "off";
		break;
	}

	sprintf(target, "%s%s", message);
	return target;
}


void connectWiFi() {
	WiFi.mode(WIFI_STA);
	WiFi.setAutoConnect(true);
	WiFi.persistent(true);
	WiFi.setHostname("MS-System");
	WiFi.begin(wifi.ssid, wifi.password);
}
bool serverActivated = false;

void updateWiFiStatus() {
	switch (WiFi.status()) {
	case WL_CONNECTED:
		wifi.state = MS_WIFI_CONNECTED;
		break;
	case WL_DISCONNECTED:
		wifi.state = MS_WIFI_DISCONNECTED;
		break;
	case WL_CONNECT_FAILED:
		wifi.state = MS_WIFI_FAILED;
		break;
	case WL_CONNECTION_LOST:
		wifi.state = MS_WIFI_LOST;
		break;
	case WL_IDLE_STATUS:
		wifi.state = MS_WIFI_IDLE;
		break;
	case WL_NO_SSID_AVAIL:
		wifi.state = MS_WIFI_NO_SSID;
		break;
	case WL_SCAN_COMPLETED:
		wifi.state = MS_WIFI_SCAN_COMPL;
		break;
	case WL_NO_SHIELD:
		wifi.state = MS_WIFI_NO_SHIELD;
		break;
	}
}

bool _requestAuth() {
	if (!server.authenticate("ms-system-admin", "importantpassword")) {
		server.requestAuthentication();
		return false;
	}
	return true;
}

unsigned long  _calculateOnBeforeTime(unsigned long curTime, Action* a) {
	int lastStopTime = (*a).lst;
	int onBeforeTime = lastStopTime > 0 ? curTime - lastStopTime : 0;
	return onBeforeTime;
}

void _generateStatus(DynamicJsonDocument* doc) {
	(*doc)["status"] = "OK";
	unsigned long time = millis();
	(*doc)["pump"]["active"] = state.p;
	(*doc)["pump"]["di_sec"] = settings.pd / 1000;
	(*doc)["pump"]["offtime_sec"] = settings.pi / 1000;
	(*doc)["pump"]["iue"] = settings.iue;
	(*doc)["sensors"]["di_sec"] = settings.sid / 1000;
	(*doc)["sensors"]["p_di_sec"] = settings.siw / 1000;
	(*doc)["sensors"]["ontime_sec"] = availableActions[READ_SENSORS_ACTION].td / 1000;
	(*doc)["sensors"]["on_before_mins"] = (int)(_calculateOnBeforeTime(time, &availableActions[READ_SENSORS_ACTION]) / 60000);

	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* cur = &state.s[i];
		bool isActive = (*cur).active;
		(*doc)["sensors"][(*cur).name]["active"] = (*cur).active;
		if (isActive) {
			(*doc)["sensors"][(*cur).name]["hum_perc"] = (*cur).p;
			(*doc)["sensors"][(*cur).name]["readings"]["dry_val"] = (*cur).dry;
			(*doc)["sensors"][(*cur).name]["readings"]["wet_val"] = (*cur).wet;
			(*doc)["sensors"][(*cur).name]["readings"]["cur_val"] = (*cur).value;
			(*doc)["sensors"][(*cur).name]["on_before_mins"] = (int)(_calculateOnBeforeTime(time, &availableActions[(*cur).ai]) / 60000);
		}

		(*doc)["sensors"][(*cur).name]["thresholds"]["apv"] = (*cur).apv;
		(*doc)["sensors"][(*cur).name]["thresholds"]["dapv"] = (*cur).dapv;
	}
}

void handleStatus() {
	_generateStatus(&doc1);
	serializeJson(doc1, stringPool1024b1);
	server.send(200, "application/json", (char*)stringPool1024b1);
	doc1.clear();
	memset(stringPool1024b1, 0, 1024);
}

void handleModifySetting() {
	if (_requestAuth()) {

