deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
		String body = server.arg("plain");
		body.getBytes(stringPool1024b1, 1024, 0);
		deserializeJson(doc1, stringPool1024b1);

		if (doc1.containsKey(MS_APV_NEAR_SETTING_KEY)) {
			state.s[MS_SENSOR_NEAR].apv = max(0, (int)min((int)doc1[MS_APV_NEAR_SETTING_KEY], state.s[MS_SENSOR_NEAR].dapv - 5));
		}

		if (doc1.containsKey(MS_DAPV_NEAR_SETTING_KEY)) {
			state.s[MS_SENSOR_NEAR].dapv = max(state.s[MS_SENSOR_NEAR].apv + 5, min((int)doc1[MS_DAPV_NEAR_SETTING_KEY], 100));
		}

		if (doc1.containsKey(MS_APV_MID_SETTING_KEY)) {
			state.s[MS_SENSOR_MID].apv = max(0, (int)min((int)doc1[MS_APV_MID_SETTING_KEY], state.s[MS_SENSOR_MID].dapv - 5));
		}

		if (doc1.containsKey(MS_DAPV_MID_SETTING_KEY)) {
			state.s[MS_SENSOR_MID].dapv = max(state.s[MS_SENSOR_MID].apv + 5, min((int)doc1[MS_DAPV_MID_SETTING_KEY], 100));
		}

		if (doc1.containsKey(MS_APV_FAR_SETTING_KEY)) {
			state.s[MS_SENSOR_FAR].apv = max(0, (int)min((int)doc1[MS_APV_FAR_SETTING_KEY], state.s[MS_SENSOR_FAR].dapv - 5));
		}

		if (doc1.containsKey(MS_DAPV_FAR_SETTING_KEY)) {
			state.s[MS_SENSOR_FAR].dapv = max(state.s[MS_SENSOR_FAR].apv + 5, min((int)doc1[MS_DAPV_FAR_SETTING_KEY], 100));
		}

		if (doc1.containsKey(MS_PUMP_MAX_DURATION_SETTING_KEY)) {
			settings.pd = min(5 * 60000, max((int)doc1[MS_PUMP_MAX_DURATION_SETTING_KEY], 60000));
		}

		if (doc1.containsKey(MS_PUMP_REACT_INT_DURATION_SETTING_KEY)) {
			settings.pi = min(20 * 60000, max((int)doc1[MS_PUMP_REACT_INT_DURATION_SETTING_KEY], 60000));
		}

		if (doc1.containsKey(MS_NEAR_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_NEAR].active = (doc1[MS_NEAR_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		if (doc1.containsKey(MS_MID_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_MID].active = (doc1[MS_MID_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		if (doc1.containsKey(MS_FAR_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_FAR].active = (doc1[MS_FAR_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		if (doc1.containsKey(MS_IRRIGATE_UNTIL_EXPIRY_KEY)) {
			settings.iue = doc1[MS_IRRIGATE_UNTIL_EXPIRY_KEY] == true ? true : false;
		}

		_generateStatus(&doc2);
		serializeJson(doc2, stringPool1024b2);
		server.send(200, "application/json", (char*)stringPool1024b2);

		doc1.clear();
		doc2.clear();
		memset(stringPool1024b1, 0, 1024);
		memset(stringPool1024b2, 0, 1024);

		storeSetPreferences();
	}
}

void handleCommandRestart() {
	if (_requestAuth()) {
		server.send(200, "text/plain", "Restaring...");
		delay(2000);
#ifdef ARDUINO_ARCH_ESP32
		ESP.restart();
#endif
	}
}


void setupWebServer() {
	server.on("/api/status", HTTP_GET, &handleStatus);
	server.on("/api/modify/setting", HTTP_POST, &handleModifySetting);
	server.on("/api/command/restart", HTTP_POST, &handleCommandRestart);
	server.onNotFound([]() {server.send(404, "text/plain", "Sorry ;)"); });
	server.begin();
}

void startWifi(Action* a) {
	connectWiFi();
	setupWebServer();
}

void tickWifi(Action* a) {
	updateWiFiStatus();

	if (wifi.state == MS_WIFI_IDLE) {
		WiFi.reconnect();
	}

	server.handleClient();
}

void stopWifi(Action* a) {
	server.stop();
	WiFi.disconnect();
	WiFi.mode(WIFI_OFF);
	wifi.state = MS_WIFI_STOPPED;
}

// end of wifi

// Sensors

void startInterpret(Action* a) {
}

void stopInterpret(Action* a) {
}

void tickInterpret(Action* a) {
	bool activate = false;
	Action** acandidates = (Action**)malloc(sizeof(Action*) * SENSORS_COUNT);
	if (acandidates != nullptr) {
		int pc = 0;
		int ac = 0;
		for (int i = 0; i < SENSORS_COUNT; i++) {
			Sensor* se = &state.s[i];
			Action* ca = &availableActions[(*se).ai];
			float v = (float)(*se).value;
			float d = (float)(*se).dry;
			float w = (float)(*se).wet;
			float dwd = _max(0.00001, d - w);

			float mp = ((d - _min(_max(v, w), d)) / dwd) * 100.0;
			(*se).p = (int)mp;

			activate = (*se).active && (bool)((long)mp < ((*ca).state == MS_RUNNING ? (*se).dapv : (*se).apv));

			acandidates[i] = nullptr;
			if (activate && ca != nullptr) {
				ac++;
				if ((*ca).state == MS_NON_ACTIVE) {
					acandidates[i] = ca;
					pc++;
				}
				else if ((*ca).state == MS_PENDING) {
					requestStop(&executionList, ca);
				}
			}
			else if (!settings.iue && ca != nullptr) {
				// Stop the action for which activate is false
				requestStop(&executionList, ca);
			}
		}

		// if the available outlets are equal to the 
		// ones needed to be activated - we select the 
		// one that was activated the earliest
		if (pc > 0 && pc == ac) {

			Action* ts = nullptr;
			for (int i = 0; i < SENSORS_COUNT; i++) {
				Action* c = acandidates[i];

				if (c != nullptr) {
					if (ts != nullptr) {
						if ((*c).st < (*ts).st) {
							ts = c;
						}
					}
					else {
						ts = c;
					}
				}
			}

			if (ts != nullptr) {
				scheduleAction(&executionList, ts);
			}
		}
		bool isPumpOpen = availableActions[PUMP_ACTION].state == MS_CHILD_RUNNING || availableActions[PUMP_ACTION].state == MS_CHILD_SCHEDULED;
		availableActions[READ_SENSORS_ACTION].ti = isPumpOpen ? settings.siw : settings.sid;

		free(acandidates);
	}
}

void startSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
	state.sa = true;
}

void stopSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	state.sa = false;
	scheduleAction(&executionList, &availableActions[INTERPRET_SENSOR_DATA_ACTION]);
}

void tickSensors(Action* a) {

	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_NEAR].value, PIN_NEAR);
	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_MID].value, PIN_MID);
	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_FAR].value, PIN_FAR);
}

//end of sensors

// Display

const char* _hsResolveSensorInfo(char* target, Sensor* s) {
	if ((*s).active) {
		sprintf(target, "%d%%", (*s).p);
	}
	else {
		return MS_OFF_STRING;
	}
	return target;
}

void drawHomeScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool30b1, "N: %s M: %s F: %s", _hsResolveSensorInfo(stringPool5b1, &state.s[MS_SENSOR_NEAR]), _hsResolveSensorInfo(stringPool5b2, &state.s[MS_SENSOR_MID]), _hsResolveSensorInfo(stringPool5b3, &state.s[MS_SENSOR_FAR]));
	sprintf(stringPool30b2, "VN: %s VM: %s VF: %s", state.vn ? MS_ON_STRING : MS_OFF_STRING, state.vm ? MS_ON_STRING : MS_OFF_STRING, state.vf ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool30b3, "PUMP: %s SENSORS: %s", state.p ? MS_ON_STRING : MS_OFF_STRING, state.sa ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool20b1, "WIFI: %s", _resolveWiFIStatusString(stringPool20b2, wifi.state));
	char* message[] = { stringPool30b1, stringPool30b2, stringPool30b3, stringPool20b1 };
	printAlignedTextStack(&mainCanvas, message, 4, 1, MS_H_CENTER, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, "B1 - menu", 1, (MS_H_CENTER | MS_V_BOTTOM));
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

