deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	boxX += circleRadius * 2 + spacing;

	printAlignedText(&mainCanvas, "B1 - Back, B3 - toggle", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleWIFIToggleScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		if (availableActions[WIFI_ACTION].state == MS_RUNNING) {
			requestStop(&executionList, &availableActions[WIFI_ACTION]);
			wifi.isActive = false;
		}
		else if (availableActions[WIFI_ACTION].state == MS_NON_ACTIVE) {
			scheduleAction(&executionList, &availableActions[WIFI_ACTION]);
			wifi.isActive = true;
		}
	}

	storeSetPreferences();
}

void drawConnectivityInfoScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	if (wifi.state != MS_WIFI_STOPPED) {
		String ip = WiFi.localIP().toString();
		ip.getBytes((unsigned char*)stringPool20b4, 20, 0);
		sprintf(stringPool20b1, "IP: %s", stringPool20b4);
		sprintf(stringPool20b2, "SSID: %s", WiFi.SSID());
		sprintf(stringPool20b3, "Host: %s", WiFi.getHostname());
		char* text[] = { stringPool20b1, stringPool20b2, stringPool20b3 };
		printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	}
	else {
		printAlignedText(&mainCanvas, "WIFI: OFF", MS_FONT_TEXT_SIZE_LARGE, MS_H_CENTER | MS_V_CENTER);
	}
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleConnectivityInfoScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
}

void drawConnectivitySettingsScreen(Action* a) {

	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - WiFi On/Off", "B3 - Network info" };
	printAlignedTextStack(&mainCanvas, text, 2, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleConnectivitySettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_WIFI_TOGGLE_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_CONNECTIVITY_INFO_SCREEN;
	}
}

void drawMenuScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Settings", "B3 - Processes", "B4 - Connectivity" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleMenuScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_HOME_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_PROCESSES_SCREEN;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
}


char** running = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** stopped = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** pending = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** scheduled = (char**)calloc(sizeof(char*), ACTIONS_COUNT);

void drawProcessesScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	int stoppedCount = 0;
	int pendingCount = 0;
	int scheduledCount = 0;
	int runningCount = 0;

	pending[pendingCount++] = "P: ";
	scheduled[scheduledCount++] = "SC: ";
	running[runningCount++] = "R: ";
	stopped[stoppedCount++] = "S: ";

	for (int i = 0; i < ACTIONS_COUNT; i++) {
		Action* current = &availableActions[i];
		switch ((*current).state) {
		case MS_PENDING:
		case MS_CHILD_PENDING:
			pending[pendingCount++] = (*current).name;
			break;
		case MS_SCHEDULED:
			scheduled[scheduledCount++] = (*current).name;
			break;
		case MS_RUNNING:
		case MS_CHILD_RUNNING:
			running[runningCount++] = (*current).name;
			break;
		case MS_NON_ACTIVE:
			stopped[stoppedCount++] = (*current).name;
			break;
		}
	}
	joinStrings(pending, pendingCount, ", ", stringPool50b1, 1);
	joinStrings(stopped, stoppedCount, ", ", stringPool50b2, 1);
	joinStrings(scheduled, scheduledCount, ", ", stringPool50b3, 1);
	joinStrings(running, runningCount, ", ", stringPool50b4, 1);

	char* message[] = { stringPool50b1, stringPool50b2, stringPool50b3, stringPool50b4 };

	printAlignedTextStack(&mainCanvas, message, 4, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_LEFT | MS_V_TOP);

	memset(stringPool50b1, 0, pendingCount);
	memset(stringPool50b2, 0, stoppedCount);
	memset(stringPool50b3, 0, scheduledCount);
	memset(stringPool50b4, 0, runningCount);

	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleProcessesScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
}

void drawSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Intervals", "B3 - Sensors", "B4 - Thresholds" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

