deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	availableScreens[MS_CONNECTIVITY_INFO_SCREEN].drawUI = &drawConnectivityInfoScreen;
	availableScreens[MS_CONNECTIVITY_INFO_SCREEN].handleButtons = &handleConnectivityInfoScreen;

	availableScreens[MS_WIFI_TOGGLE_SCREEN].drawUI = &drawWIFIToggleScreen;
	availableScreens[MS_WIFI_TOGGLE_SCREEN].handleButtons = &handleWIFIToggleScreen;
}

void populateActions() {


	// wifi action
	availableActions[WIFI_ACTION].tick = &tickWifi;
	availableActions[WIFI_ACTION].frozen = false; // when stopped the action will be removed from the list
	availableActions[WIFI_ACTION].stopRequested = false;
	availableActions[WIFI_ACTION].start = &startWifi;
	availableActions[WIFI_ACTION].stop = &stopWifi;
	availableActions[WIFI_ACTION].ti = 1;
	availableActions[WIFI_ACTION].td = 0; // duration of 0 means we never stop
	availableActions[WIFI_ACTION].to = 0;
	availableActions[WIFI_ACTION].clear = false;
	availableActions[WIFI_ACTION].state = MS_NON_ACTIVE;
	availableActions[WIFI_ACTION].child = nullptr;
	availableActions[WIFI_ACTION].lst = 0;
	availableActions[WIFI_ACTION].st = 0;
	availableActions[WIFI_ACTION].name = "wifi";

	// interpret sensor data action
	availableActions[INTERPRET_SENSOR_DATA_ACTION].tick = &tickInterpret;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].frozen = false;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].stopRequested = false;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].start = &startInterpret;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].stop = &stopInterpret;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].ti = 1;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].td = 1;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].to = 0;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].clear = false;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].state = MS_NON_ACTIVE;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].child = nullptr;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].lst = 0;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].st = 0;
	availableActions[INTERPRET_SENSOR_DATA_ACTION].name = "interpret";


	// read sensors action
	availableActions[READ_SENSORS_ACTION].tick = &tickSensors;
	availableActions[READ_SENSORS_ACTION].frozen = true;
	availableActions[READ_SENSORS_ACTION].stopRequested = false;
	availableActions[READ_SENSORS_ACTION].start = &startSensors;
	availableActions[READ_SENSORS_ACTION].stop = &stopSensors;
	availableActions[READ_SENSORS_ACTION].ti = settings.siw;
	availableActions[READ_SENSORS_ACTION].td = settings.sd;
	availableActions[READ_SENSORS_ACTION].to = 200;
	availableActions[READ_SENSORS_ACTION].clear = false;
	availableActions[READ_SENSORS_ACTION].state = MS_NON_ACTIVE;
	availableActions[READ_SENSORS_ACTION].child = nullptr;
	availableActions[READ_SENSORS_ACTION].lst = 0;
	availableActions[READ_SENSORS_ACTION].st = 0;
	availableActions[READ_SENSORS_ACTION].name = "sensors";

	// open far valve action
	availableActions[OUTLET_FAR_ACTION].tick = &tickFarOutlet;
	availableActions[OUTLET_FAR_ACTION].frozen = false;
	availableActions[OUTLET_FAR_ACTION].stopRequested = false;
	availableActions[OUTLET_FAR_ACTION].start = &startFarOutlet;
	availableActions[OUTLET_FAR_ACTION].stop = &stopFarOutlet;
	availableActions[OUTLET_FAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_FAR_ACTION].td = settings.pd;
	availableActions[OUTLET_FAR_ACTION].clear = false;
	availableActions[OUTLET_FAR_ACTION].to = 0;
	availableActions[OUTLET_FAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_FAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_FAR_ACTION].lst = 0;
	availableActions[OUTLET_FAR_ACTION].st = 0;
	availableActions[OUTLET_FAR_ACTION].name = "valve-far";


	state.s[MS_SENSOR_FAR].ai = OUTLET_FAR_ACTION;

	// open mid valve action
	availableActions[OUTLET_MID_ACTION].tick = &tickMidOutlet;
	availableActions[OUTLET_MID_ACTION].frozen = false;
	availableActions[OUTLET_MID_ACTION].stopRequested = false;
	availableActions[OUTLET_MID_ACTION].start = &startMidOutlet;
	availableActions[OUTLET_MID_ACTION].stop = &stopMidOutlet;
	availableActions[OUTLET_MID_ACTION].ti = settings.pi;
	availableActions[OUTLET_MID_ACTION].td = settings.pd;
	availableActions[OUTLET_MID_ACTION].clear = false;
	availableActions[OUTLET_MID_ACTION].to = 0;
	availableActions[OUTLET_MID_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_MID_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_MID_ACTION].lst = 0;
	availableActions[OUTLET_MID_ACTION].st = 0;
	availableActions[OUTLET_MID_ACTION].name = "valve-mid";

	state.s[MS_SENSOR_MID].ai = OUTLET_MID_ACTION;

	// open near valve action
	availableActions[OUTLET_NEAR_ACTION].tick = &tickNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].frozen = false;
	availableActions[OUTLET_NEAR_ACTION].stopRequested = false;
	availableActions[OUTLET_NEAR_ACTION].start = &startNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].stop = &stopNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_NEAR_ACTION].td = settings.pd;
	availableActions[OUTLET_NEAR_ACTION].clear = false;
	availableActions[OUTLET_NEAR_ACTION].to = 0;
	availableActions[OUTLET_NEAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_NEAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_NEAR_ACTION].lst = 0;
	availableActions[OUTLET_NEAR_ACTION].st = 0;
	availableActions[OUTLET_NEAR_ACTION].name = "valve-near";

	state.s[MS_SENSOR_NEAR].ai = OUTLET_NEAR_ACTION;

	// start pump action
	availableActions[PUMP_ACTION].tick = &tickPump;
	availableActions[PUMP_ACTION].frozen = false;
	availableActions[PUMP_ACTION].stopRequested = false;
	availableActions[PUMP_ACTION].start = &startPump;
	availableActions[PUMP_ACTION].stop = &stopPump;
	availableActions[PUMP_ACTION].ti = 0;
	availableActions[PUMP_ACTION].td = 0;
	availableActions[PUMP_ACTION].clear = false;
	availableActions[PUMP_ACTION].to = 0;
	availableActions[PUMP_ACTION].state = MS_NON_ACTIVE;
	availableActions[PUMP_ACTION].child = nullptr;
	availableActions[PUMP_ACTION].lst = 0;
	availableActions[PUMP_ACTION].st = 0;
	availableActions[PUMP_ACTION].name = "pump";


