deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
		// fire buzzer to notify that dry values have been read
		drawDryValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2 for", "wet state");
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].wet, PIN_NEAR);
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_MID].wet, PIN_MID);
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_FAR].wet, PIN_FAR);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_WET_SETTING_KEY, state.s[MS_SENSOR_NEAR].wet);
		preferences.putInt(MS_MID_WET_SETTING_KEY, state.s[MS_SENSOR_MID].wet);
		preferences.putInt(MS_FAR_WET_SETTING_KEY, state.s[MS_SENSOR_FAR].wet);
#else
		EEPROM.put(sizeof(int) * 3, state.s[MS_SENSOR_NEAR].wet);
		EEPROM.put(sizeof(int) * 4, state.s[MS_SENSOR_MID].wet);
		EEPROM.put(sizeof(int) * 5, state.s[MS_SENSOR_FAR].wet);
#endif


		// wet values have been read
		drawWetValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2", "start...");
		// click to continue
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		showTextCaptionScreen(&display, MS_STARTING_PROMPT_TEXT);
		delay(2000);
		digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
#ifdef ARDUINO_ARCH_ESP32
		preferences.end();
#endif
	}
}

// Fix for WIFI + analogRead from ADC2 issue

uint64_t reg_a;
uint64_t reg_b;
uint64_t reg_c;

void storeADC2ConfigRegisters() {
	//reg_a = READ_PERI_REG(SENS_SAR_START_FORCE_REG);
	reg_b = READ_PERI_REG(SENS_SAR_READ_CTRL2_REG);
	//reg_c = READ_PERI_REG(SENS_SAR_MEAS_START2_REG);
}

void restoreADC2ConfigRegisters() {
	//WRITE_PERI_REG(SENS_SAR_START_FORCE_REG, reg_a);
	WRITE_PERI_REG(SENS_SAR_READ_CTRL2_REG, reg_b);
	//WRITE_PERI_REG(SENS_SAR_MEAS_START2_REG, reg_c);
}

// Read the following threads for more information:
// https://github.com/espressif/arduino-esp32/issues/102
// https://github.com/espressif/arduino-esp32/issues/440
int fixedAnalogRead(int pin) {
	restoreADC2ConfigRegisters();
	SET_PERI_REG_MASK(SENS_SAR_READ_CTRL2_REG, SENS_SAR2_DATA_INV);
	return analogRead(pin);
}

//

void setup() {
	storeADC2ConfigRegisters();
	pinMode(PIN_FAR, INPUT);
	pinMode(PIN_MID, INPUT);
	pinMode(PIN_NEAR, INPUT);

	pinMode(PIN_VALVE_FAR, OUTPUT);
	pinMode(PIN_VALVE_MID, OUTPUT);
	pinMode(PIN_VALVE_NEAR, OUTPUT);

	digitalWrite(PIN_VALVE_FAR, HIGH);
	digitalWrite(PIN_VALVE_MID, HIGH);
	digitalWrite(PIN_VALVE_NEAR, HIGH);

	pinMode(BUTTONS_PIN, INPUT);

	pinMode(PUMP_PIN, OUTPUT); // pump relay
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);

	pinMode(SENSOR_PIN, OUTPUT); // sensor relay
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	Serial.begin(9600);

	allocateMemPools();
	initActionsList(ACTIONS_COUNT);
	ms_init();

	setupInitialState();
}

void loop() {
	doQueueActions(&executionList);
}
